posts/2019-12-20-emacs-journey/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Emacs Journey 2019</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">My Emacs Journey 2019</h1>
</header><p>
Let me start my saying that yes, I still use Emacs. What a surprise. In fact,
Emacs is one of my most used tools besides other stables such as a browser. What
has changed though, is how I am using some aspects of this little editor.
</p>

<div id="outline-container-orga460601" class="outline-2">
<h2 id="orga460601">What Has Not Changed</h2>
<div class="outline-text-2" id="text-orga460601">
<p>
I still believe, that Emacs is not the "right" tool for everything. I'm still
jumping into Notepad++ if I want to do a very quick edit on a Windows machine.
I'm also not thinking about moving tasks such as e-mail into Emacs.
</p>
</div>
</div>

<div id="outline-container-org28ad18b" class="outline-2">
<h2 id="org28ad18b">Terrific Task Management</h2>
<div class="outline-text-2" id="text-org28ad18b">
<p>
Org-mode is great. It has replaced all other note taking or calendar management
software that I was using. Everything (well, 90%) lives in org-mode. I have one
"big" (300 lines-ish) file which contains everything I'd like to remember or
would like to do.
</p>
</div>
</div>

<div id="outline-container-orgf06f210" class="outline-2">
<h2 id="orgf06f210">Underwhelming Windows Performance</h2>
<div class="outline-text-2" id="text-orgf06f210">
<p>
My Windows machines run a native version of Emacs, which is&#x2026; just ok. Some
actions take a few seconds, which just feels sluggish, but that's something that
I have to live with for now.
</p>

<p>
One of my biggest pain points was setting up spell checking on Windows. It might
sound too simple, but it took me several attempts before I pulled it off. Thanks
<a href="/posts/2019-04-10-emacs-wsl">WSL</a>.
</p>
</div>
</div>

<div id="outline-container-orga44fa55" class="outline-2">
<h2 id="orga44fa55">Literate Dotfiles</h2>
<div class="outline-text-2" id="text-orga44fa55">
<p>
Most of my config files and custom scripts live in an org file inside a git
repository. Using a simple shortcut, I can create "real" config files based on
this org file. I have mentioned this process in a <a href="/posts/2019-08-10-literate-dotfiles">previous post</a>.
</p>
</div>
</div>

<div id="outline-container-org8c0cc2b" class="outline-2">
<h2 id="org8c0cc2b">Keybindings</h2>
<div class="outline-text-2" id="text-org8c0cc2b">
<p>
Emacs keybindings can feel clunky and some people even feel pain after using
them for too long. Based on several resources (such as <a href="https://karl-voit.at/2018/07/08/emacs-key-bindings/">this one</a>), I have created
a whole set of custom keybindings which are based on sequences instead of
chords. Instead of pressing "Control + x" and "Control + f" (<code>C-x C-f</code>) I can
now press "Apps" and "f" to search for a file. It took me some time to get used
to some of these bindings, but I think it was worth the effort. And if I ever
end up in a situation where I have to use a keyboard without an "Apps" key, I
can still fallback to the "normal" keybindings.
</p>
</div>
</div>

<div id="outline-container-org6336496" class="outline-2">
<h2 id="org6336496">Strong Stables</h2>
<div class="outline-text-2" id="text-org6336496">
<p>
I'd like to make a quick shout out to some fantastic packages which I use
everyday:
</p>

<ul class="org-ul">
<li>elfeed (my RSS reader)</li>
<li>ivy, counsel, swiper (improved search and navigation)</li>
<li>magit (hands down, the best git client I have ever used)</li>
<li>neotree (a tree based file viewer)</li>
</ul>
</div>
</div>

<div id="outline-container-org596526c" class="outline-2">
<h2 id="org596526c">The Journey Continues</h2>
<div class="outline-text-2" id="text-org596526c">
<p>
Even though the learning curve started out steep, I'm glad that I picked up
Emacs. For now, I don't have any specific goals on how this journey should
continue. Instead, I'll just have to see where things take me.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2019-12-20</p>
<footer>
<p>Copyright 2025, Florian Winkelbauer. All rights reserved.</p>
</footer>
</div>
</body>
</html>
